Tekla.Structures.DirectManipulation.Adapter.EventRegistry.ViewEvents
The Tekla.Structures.DirectManipulation.Adapter.EventRegistry.ViewEvents class contains the identifiers for view events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.ViewEvents.ViewChanged
Expected identification string for view change events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.ViewEvents.ViewClosed
Expected identification string for view closed events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.ViewEvents.ViewOpened
Expected identification string for view opened events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.ViewEvents.ViewIdentifiersChanged
Expected identification string for view identifiers changed events.